#+CATEGORY: Metodika přístupnosti dokumentů
#+DATE: datum
#+MACRO: version 0.0
#+TITLE: Metodika pro přístupnost dokumentů
#+AUTHOR: EGdílna.cz a další přispěvatelé
#+LANGUAGE: cs
#+OPTIONS: H:4 toc:nil prop:1
#+TODO: NEZAHÁJENO(n) ZADÁNO(z) ROZPRACOVANÉ(r) DODĚLAT(d) POKOREKTUŘE UPRAVOVÁNO(u) | KEKOREKTUŘE(k) HOTOVO(h) FINÁLNÍ(f) AKTUALIZOVÁNO(a)
#+STARTUP: fninline
#+STARTUP: customtime
| Název: | {{{TITLE}}} |
| Předmět: | Ucelený metodický dokument pro pochopení a návody k tvorbě přístupných digitálních dokumentů (nejen) veřejné správy |
| Verze: | Verze {{{version}}} ze dne {{{DATE(%d.%m.%Y)}}}
| Autoři: | {{{AUTHOR}}} |
| Určeno pro: | Všechny veřejnosprávní původce a veřejnoprávní subjekty |
| Důvod předložení: | Související úkoly OSGA a plnění příbuzných úkolů Národního plánu pro rovné příležitosti OZP. Především ale metodika pro faktické plnění povinnosti přístupných dokumentů. |
#+TOC: headlines 3

----------
* KEKOREKTUŘE Úvod
CLOSED: [2022-02-10 Thu 19:09]
** KEKOREKTUŘE Účel a použití metodiky
:LOGBOOK:
CLOCK: [2022-02-08 út 07:44]--[2022-02-08 út 07:54] =>  0:10
:END:
Tento metodický dokument slouží veřejnoprávním původcům pro lepší pochopení a návod na splnění povinnosti tzv. přístupnosti dokumentů. Protože jde o technickou oblast, která vyžaduje hluboké technické znalosti, ukazuje se nezbytným původcům v této oblasti pomoci.

Dokument je určen dvěma hlavním skupinám uživatelů:

- Manažerům v organizacích původců: V tomto dokumentu se vysvětluje, co je to přístupnost dokumentů, proč ji řešit, jak pomáhá nejen osobám se zdravotním postižením a se specifickými potřebami a především na co nezapomenout a jak do toho. Manažer pak bude vědět, co po kom chtít, aby povinnosti byly řádně splněny.
- Odborným a technickým  pracovníkům: Tento dokument obsahuje i podrobné technické a procesní informace o přístupnosti digitálních dokumentů, o jednotlivých formátech a jejich podrobných specifikacích a o jejich řešení. Metodici a manažeři spisové služby, ale i IT pracovníci se v něm dozví, co konkrétně musejí zajistit, aby jejich dokumenty v digitální podobě splňovaly veškeré technické požadavky na jejich přístupnost.
** KEKOREKTUŘE Publikace metodiky a připomínky                :doplnitodkazy:
:LOGBOOK:
CLOCK: [2022-02-08 út 07:54]--[2022-02-08 út 08:07] =>  0:13
:END:

Veškeré podrobnosti, včetně předchozích verzí, pracovních podkladů a poznámek a také seznamu a stavu připomínek lze nalézt v otevřeném GIT repozitáři [[https://github.com/egdilna/metodiky-pristupnost-dokumentu][GitHub - egdilna/metodiky-pristupnost-dokumentu: Metodiky pro přístupnost digitálních dokumentů...]]

Aktuální verze je k dispozici vždy na následujících URL adresách:

Webová verze metodiky k náhledu a čtení

- [[https://github.com/egdilna/metodiky-pristupnost-dokumentu/blob/main/Metodika-pristupnost-dokumentu.org][https://github.com/egdilna/metodiky-pristupnost-dokumentu/blob/main/Metodika-pristupnost-dokumentu.org]]

  Ke stažení v otevřeném editovatelném formátu

  -

Jakékoliv připomínky či dotazy a návrhy na změny a doplnění lze přidávat vytvořením nového issue v repozitáři, kde lze také sledovat postup prací a již vytvořené issues a to      [[https://github.com/egdilna/metodiky-pristupnost-dokumentu/issues][v sekci Issues v repozitáři]]
** HOTOVO Historie verzí
Toto je první verze metodiky z března 2022. V případě dalších verzí zde bude jejich seznam a u každé verze také popis změn.
** HOTOVO Významy některých technických pojmů
:LOGBOOK:
CLOCK: [2022-02-08 út 08:08]--[2022-02-08 út 08:51] =>  0:43
:END:
Kromě obecně používaných pojmů z oblasti spisové služby, má přístupnost dokumentů několik vlastních odborných termínů, které se v tomto dokumentu používají a u kterých musí čtenář dobře znát jejich význam:

- Přístupnost dokumentů: Část schopnosti úřadu Správa dokumentů, která zajistí, aby každý dokument vzniklý z vlastní činnosti úřadu byl přístupný (definuje význam a potřeba pojmu)
- Přístupný dokument: Dokument, s jehož obsahem se může seznámit kdokoliv, tedy i osoba se zdravotním postižením, a to bez nutnosti dodatečného zpracování obsahu dokumentu způsobem, k němuž nebyl dokument určen. (definuje význam a potřeba pojmu)
- Textová reprezentace: V rámci každého dokumentu se používá logický strom značených struktur, který poskytuje smysluplné pořadí čtení obsahu a také metodu pro definování role strukturálních prvků a vztahu k obsahu stránky. V rámci této struktury značek lze poskytnout další vlastnosti, jako je alternativní text a náhradní text. (definuje překlad ISO specifikací)
- Kontejner dokumentu: Technická část datového souboru digitálního dokumentu obsahující jednu či více komponent obsahu dokumentu, nebo komponent a jejich textových vrstev (definuje překlad ISO specifikací)
- Textová vrstva: Reprezentace veškerého významového obsahu dokumentu formou prostého textu a jeho speciálních atributů, aby bylo možno reprezentovat jakýkoliv obsah a jeho druh a význam pouhým čtením prosté textové informace (definuje překlad ISO specifikací)
- Tagovaný obsah: Textová vrstva obsahu dokumentu, která kromě samotného textu obsahuje i jeho speciální atributy, ze kterých je zřejmé, o jaký typ obsahu se jedná a jaký je jeho význam (definuje překlad ISO specifikací)
* NEZAHÁJENO Manažerské shrnutí
* NEZAHÁJENO Přístupnost dokumentů
** NEZAHÁJENO Co je přístupnost dokumentů a proč to řešit?
** KEKOREKTUŘE Přístupný dokument a nepřístupný dokument  :aktuálněrozdělané:
CLOSED: [2022-02-14 Mon 12:27] SCHEDULED: <2022-02-11 Fri>
:LOGBOOK:
CLOCK: [2022-02-14 Mon 12:21]--[2022-02-14 Mon 12:27] =>  0:06
:END:
Je důležité co nejlíp porozumět tomu, jaký dokument je a není přístupný. Přístupné dokumenty jsou sice povinnost, ale především je to nutnost. Pro uživatele je totiž řádně čitelný jen přístupný dokument.
*** KEKOREKTUŘE Co je to vlastně přístupný dokument a jak se s ním dá pracovat
SCHEDULED: <2022-02-14 Mon>
:LOGBOOK:
CLOCK: [2022-02-15 Tue 09:05]--[2022-02-15 Tue 09:10] =>  0:05
CLOCK: [2022-02-15 Tue 09:01]--[2022-02-15 Tue 09:04] =>  0:03
CLOCK: [2022-02-15 Tue 06:25]--[2022-02-15 Tue 07:10] =>  0:45
CLOCK: [2022-02-14 Mon 12:28]--[2022-02-14 Mon 12:47] =>  0:19
:END:
Přístupný dokument je digitální dokument, který je technicky vytvořen tak, že s ním a s jeho obsahem může pracovat kdokoliv a to včetně osob se zdravotním postižením.ti totiž potřebují pracovat s textem jeho obsahu. Dokument třeba ve formátu PDF nemusí být totiž přístupný jen proto, že je v PDF. To co vidí běžný uživatel na obrazovce totiž může být jen obrazová informace, nikoliv text ve strojově čitelném formátu. Představte si to jako kdybyste se pokusili editovat v textovém editoru pouhý obrázek textu. Nemůžete ho upravovat a ani text z něj zkopírovat do jiného dokumentu. A přesně takhle technicky funguje práce s textovým obsahem přístupného dokumentu. Uživatelé, kteří text nevidí, si jej musí nechat přečíst buď počítačovým hlasem a nebo na braillském řádku braillovým písmem. Pokud je dokument vytvořen správně, tak se s jeho obsahem může takový uživatel seznámit jako ostatní, ale kdokoliv si z textu dokumentu může i cokoliv zkopírovat a nebo poznamenat. Zkrátka, nepracuje s obrazem viditelným na obrazovce, ale s textem jako v textovém editoru. Formát PDF/a navíc zajistí, že s obsahem dokumentu nikdo nemůže manipulovat a v textu něco změnit. Uživatel vždy věří obsahu textové vrstvy a proto je zásadní požadavek na shodu obrazu s textem.

Jak se s přístupným dokumentem pracuje? Běžný úživatel s ním pracuje zcela klasicky jako s jakýmkoliv jiným dokumentem, nicméně může využívat výhody, jako je hledání v textu, možnost si část textu označit a zkopírovat a nebo si dokument nechat číst nahlas umělým hlasem (to se hodí zejména u delších dokumentů a elektronických knih). Také informační systémy a aplikace mohou těžit z toho, že dokument obsahuje strojově čitelný text a tak lze v takových dokumentech třeba i indexována, nebo prohledávat celé složky na konkrétní text.

Uživatel s nějakým zdravotním postižením (většinou se pochopitelně jedná o nevidomé či slabozraké) používá tzv. "Asistivní technologie", tedy software schopný text číst umělým hlasem, či zobrazit na braillském řádku. Nebo software umožňující mu upravit obraz (zvětšit a zvíraznit text, obrátit barvy, apod.). Takzvané odečítače obrazovky zprostředkovávájí jakýkoliv textový obsah viditelný na obrazovce a tedy i text dokumentu. Zatímco třeba na webových stránkách a nebo v textovém editoru to není problém, u procházení digitálního dokumentu v PDF záleží právě na tom, jestli dané PDF má textovou reprezentaci a textovou vrstvu Bez ní se jedná jen o obrazové PDF a to z principu čitelné není. S textovou vrstvou ale uživatel prochází text dokumentu jako na webové stránce a to včetně případných odkazů, nadpisů, částí a popsaných obrázků. Uživatel asistivních technologií může dokumentem procházet, číst jednotlivá slova, věty či celé odstavce, rychle se přesouvat mezi částmi textu, nadpisy, odkazy, formulářovými prvky a dalším typem obsahu. Pro něj je to tak jediná cesta, jak s takovým digitálním dokumentem pracovat.

Pracovat svým způsobem může i s analogovým (listinným) dokumentem a to jeho naskenováním a ppřevodem OCR, ale to zdaleka není tak pohodlné a především to není stoprocentní. Více v kapitole [[*Jak má správně vypadat analogová verze dokumentu, aby šla zpracovat asistivní technologií][Jak má správně vypadat analogová verze dokumentu, aby šla zpracovat asistivní technologií]]. Protože ale veřejnoprávní původci musejí povinně vytvářet výhradně digitální dokumenty, takováto situace defacto vůbec nemůže nastat. Ale velice podobné to může být s naskenovaným PDF dokumentem. Taková situace u vlastních dokumentů původce ale také nesmí nastat, neboť by tím byl porušen zákon ve formě vyhotovení druhu a formátu dokumentu.

Dokument musí splňovat základní [[*Technické charakteristiky a vlastnosti přístupného dokumentu][Technické charakteristiky a vlastnosti přístupného dokumentu]] aby byl pro každého uživatele a každý systém zcela přístupný. U dokumentů veřejné správy je to o to důležitější, že v takových dokumentech jsou pro uživatele mnohdy zcela zásadní informace a určují a mění jeho práva a povinnosti. I proto je přístupnost nezbytností. Navíc oběma stranám to ušetří spoustu času a nervů, také úředník může těžit z textové reprezentace dokumentu při své běžné práci i při úkonech, které v elektronickém systému spisové služby nedělá tak často (kupříkladu hledání v rozsáhlé databázi dokumentů).

Uživatelé se zdravotním postižením velice často a rádi využívají digitalizaci a digitální komunikaci s úřadem, ostatně eGovernment má jako jeden z důvodů také rovnost a přístupnost, neboť v digitální formě je vše daleko přístupnější, než v listinné. K takovému uživateli se dokumenty dostanou buď prostřednictvím jeho datové schránky (je-li příjemcem) a nebo si je najde na internetových stránkách a nově i v elektronických aplikacích či na portálu po přihlášení. Dokument si buď stáhne do zařízení nebo si jej rovnou zobrazí. Dnes je PDF prohlížeč s integrovaným odečítačem (podporou pro Asistivní technologie) součástí i každého webového prohlížeče, ale existují i specializované programy pro práci s PDF, jako je Acrobat Reader, nebo třeba i Microsoft Word. (Ve kterém se dá PDF také otevřít).
*** KEKOREKTUŘE Technické charakteristiky a vlastnosti přístupného dokumentu
    :LOGBOOK:
    CLOCK: [2022-02-04 pá 08:07]--[2022-02-08 út 09:10] => 97:03
    :END:
Jaké vlastnosti po technické stránce tedy musí dokument mít, aby byl pro uživatele s asistivní technologií přístupný? Níže jsou specifikovány hlavní charakteristiky přístupného dokumentu.

(Překlad z https://www.adobe.com/accessibility/pdf/pdf-accessibility-overview.html)

Zpřístupněná PDF obsahují mimo jiné následující charakteristiky: respektive technické náležitosti:
**** KEKOREKTUŘE Textová reprezentace
V rámci každého dokumentu se používá logický strom značených struktur, který poskytuje smysluplné pořadí čtení obsahu a také metodu pro definování role strukturálních prvků a vztahu k obsahu stránky. V rámci této struktury značek lze poskytnout další vlastnosti, jako je alternativní text a náhradní text.
**** KEKOREKTUŘE Vyhledatelný text
Dokument, který se skládá z naskenovaných obrázků textu, je ze své podstaty nepřístupný, protože obsah dokumentu je grafika představující písmena na stránce, nikoli text, který lze prohledávat. Software asistenční technologie neumí číst nebo extrahovat slova v grafické reprezentaci. Uživatelé navíc nemohou vybrat nebo upravit text nebo manipulovat s PDF kvůli přístupnosti. Naskenované obrázky textu musí být převedeny na text, který lze prohledávat pomocí optického rozpoznávání znaků (OCR) před tím, než bude řešena přístupnost v dokumentu.
**** KEKOREKTUŘE Značky struktury dokumentu a správné pořadí čtení
Pro čtení textu dokumentu a jeho prezentaci způsobem, který dává uživateli smysl, vyžaduje čtečka obrazovky nebo jiný nástroj pro převod textu na řeč, aby byl dokument strukturován. Značky struktury dokumentu v PDF definují pořadí čtení a identifikují nadpisy, odstavce, sekce, tabulky a další prvky stránky. Struktura značek také umožňuje změnu velikosti a opětovné rozložení dokumentů pro prohlížení ve větších velikostech a na mobilních zařízeních.
**** KEKOREKTUŘE Alternativní textové popisy pro netextové prvky
Funkcím dokumentu, jako jsou obrázky a interaktivní pole formulářů, nemůže uživatel čtečky obrazovky porozumět, pokud nemají přidružený alternativní text. Přestože je text odkazu k dispozici uživatelům čtečky obrazovky, je možné poskytnout smysluplnější popisy prostřednictvím náhradního (aktuálního) textu. Alternativní text pro obrázky a nástrojové tipy může pomoci mnoha uživatelům, včetně těch, kteří mají poruchy učení. Musí být také přítomny ekvivalenty pro multimédia, včetně jakýchkoli audio a video prvků.
**** KEKOREKTUŘE Písma, která umožňují extrahovat znaky do textu
Písma v přístupném PDF musí obsahovat dostatek informací, aby Acrobat mohl správně extrahovat všechny znaky do textu pro jiné účely, než je zobrazování textu na obrazovce. Acrobat extrahuje znaky do textu Unicode, když čtete PDF pomocí čtečky obrazovky nebo nástroje Read Out Loud, nebo když ukládáte jako text pro Braillovu embosovačku. Tato extrakce se nezdaří, pokud Acrobat nemůže určit, jak mapovat písmo na znaky Unicode.
**** KEKOREKTUŘE Interaktivní pole s popisky formulářů s přístupnými chybovými zprávami a bez načasování
Některá PDF obsahují interaktivní formuláře, které lidé vyplňují pomocí počítače. Aby byla přístupná, musí být pole formuláře interaktivní; to znamená, že uživatel musí mít možnost zadávat hodnoty do polí formuláře. Interaktivní formuláře PDF mají také definované pořadí tabulátorů, které umožňuje uživatelům asistenční technologie používat klávesu Tabulátor, aby logicky postupovali od jednoho pole formuláře nebo interaktivního ovládacího prvku k dalšímu. Úplné podrobnosti naleznete v dokumentu Adobe® Acrobat® Pro DC Accessibility Guide: Creating Accessible Forms. Formuláře musí poskytovat identifikaci, dávat tipy na správné vyplnění a předcházet chybám. Zadání formuláře by nemělo být časováno, pokud uživatel nemůže požadovat více času.
**** KEKOREKTUŘE Další interaktivní funkce: Hypertextové odkazy a navigační pomůcky
Navigační pomůcky v PDF – jako jsou odkazy, záložky, nadpisy, obsah a přednastavené pořadí tabulek pro pole formuláře – pomáhají všem uživatelům používat dokument, aniž by museli číst celý dokument slovo od slova. Obzvláště užitečné jsou záložky, které lze vytvořit z nadpisů dokumentů. K těmto funkcím lze přistupovat pomocí klávesnice bez spoléhání na myš a umožňují uživatelům více cest k obsahu navigace.
**** KEKOREKTUŘE Jazyk dokumentu a jednoznačný název
Určení jazyka dokumentu v PDF umožňuje některým čtečkám obrazovky přepnout aktuální syntetizátor řeči do příslušného jazyka, což umožňuje správnou výslovnost obsahu v různých jazycích. Poskytnutí nadpisu dokumentu umožňuje uživateli vyhledat a identifikovat dokument.
**** KEKOREKTUŘE Zabezpečení, které nebude zasahovat do přístupnosti
Někteří autoři PDF omezují uživatelům tisk, kopírování, extrahování, úpravy nebo přidávání komentářů k textu. Text přístupného PDF musí být k dispozici čtečce obrazovky. Nastavení zabezpečení Acrobatu lze nastavit tak, aby chránilo obsah dokumentu a zároveň nenarušovalo schopnost čtečky obrazovky převést text na obrazovce na řeč nebo Braillovo písmo.
**** KEKOREKTUŘE Ostatní charakteristiky a funkce zpřístupnění dokumentu
Existují další charakteristiky přístupných dokumentů včetně:

- Nespoléhat se pouze na barvu nebo zrakové  charakteristiky pro zprostředkování významu
- Použití barevných kombinací, které poskytují dostatečný stupeň kontrastu
- Ovládání zvuku
- Použití textu místo obrázků textu
- Žádné použití blikajících nebo blikajících prvků
- Žádné změny zaměření bez iniciace uživatelem
- Konzistentní navigace a identifikace prvků
** KEKOREKTUŘE Přístupnost dokumentů v kontextu spisové služby a správy dokumentů
   :LOGBOOK:
   CLOCK: [2022-02-15 Tue 09:10]--[2022-02-15 Tue 09:12] =>  0:02
   :END:
Instituce veřejného sektoru se souhrnně nazývají takzvanými veřejnoprávními původci. To jsou organizace a instituce, nejen úřady, které mají za povinnost tzv. výkon spisové služby. Stručně řečeno, spisová služba je vše co se týká zprávy dokumentů a to zejména u digitálních dokumentů. Tedy i přístupnost textového obsahu dokumentů je součástí této spisové služby. Proto je přístupnost dokumentů jednou s povinností výkon spisové služby.
*** NEZAHÁJENO Spisová služba jako odborná správa dokumentů
*** KEKOREKTUŘE Druhy a formy dokumentů a jejich správy
:LOGBOOK:
Podle formy dokumentů rozlišujeme dokumenty na:

- Analogové (fyzické/listinné)
- Digitální (elektronické)

Podle původu pak rozlišujeme dokumenty na:

- Doručené dokumenty (od někoho jiného)
- Dokumenty vzniklé z vlastní činnosti - vlastní dokumenty (veškeré moje)

Rozlišujeme pak obsahově/technickou formu, a to na:

- Statické textové dokumenty (dokumenty, dopisy, rozhodnutí, vyhlášky)
- Statické obrazové dokumenty (fotografie, nákresy, mapy)
- Dynamické obrazové dokumenty (video, dynamické obrazové prezentace)
- Zvukové dokumenty (záznamy zvuku, hudba)
- Databáze a datové věty (XML data)

Zatímco údaje a databáze (nejsou dokumenty) spravují úřady v příslušných informačních systémech, dokumenty musí spravovat v rámci spisové služby.

U přístupnosti dokumentů se povinnost vztahuje na dokumenty vzniklé z vlastní činnosti a to zejména pro statické textové dokumenty.


CLOCK: [2022-02-11 Fri 15:03]--[2022-02-11 Fri 15:06] =>  0:03
:END:
*** KEKOREKTUŘE Způsoby vzniku vlastního dokumentu
:LOGBOOK:
CLOCK: [2022-02-09 Wed 15:59]--[2022-02-09 Wed 16:22] =>  0:23
:END:
Dokument v úŕadu může vzniknout více různými způsoby. Přestože musejí být vždy dodrženy veškeré povinnosti a procesy správy dokumentů, technických forem vzniku a generování souboru dokumentu je více. Podle jednotlivých způsobů vzniku či získání dokumentu pro jeho odeslání nebo publikaci, platí pochopitelně i rozdílné tecnické postupy.

Můžeme se zabývat těmito základními způsoby vzniku vlastního dokumentu:

- Výstup z elektronického systému spisové služby (ESSL): I přesto, že to úřady často ignorují, jde o jedinou správnou formu vzniku jakéhokoliv dokumentu v úřadu. ESSL je systém, v němž dochází k vyhotovování a finalizaci a odesílání dokumentu. Dokument se vždy vytváří jako digitální dokument se všemi náležitostmi.
- Výstup generovaný z jiného informačního systému (AIS/ISSD): I zde se jedná o automatické generování a tvorbu souboru dokumentu informačním systémem. Dokument v tomto případě negeneruje samotný elektronický systém spisové služby, ale jiný informační systém. Při takovém generování je nutno ale pouźít správnou knihovnu pro generování PDF a dodržet veškeré technické náležitosti pro dokument.
- Dokument doplňovaný ze šablony v rámci informačního systému: Informační systém nemusí generovat dokument samostatně. V řádě případů uživatel v příslušném systému připraví určité části obsahu a systém je pak doplní do předpřipravené šablony a z ní pak technicky vygeneruje PDF dokument k jeho vyhotovení a finalizaci. I zde je nezbytné dodržet veškeré technické požadavky na výsledné PDF soubory.
- Ručně vytvářený dokument mimo informační systém (na počítači úředníka): V některých příkladech může dokument technicky vznikat i zcela mimo elektronický systém spisové služby (a musí být pak do ESSL řádně vložen a v něm spravován) a to třeba v textovém editoru nebo v jiné aplikaci na počítači zaměstnance úřadu. I v tomto případě je nutno zajistit jeho správný výstupní formát se všemi technickými náležitostmi.
- Dokument přijatý jako doručený a poskytnutý jako odeslaný: Původce odesílá/zveřejňuje i dokumenty jiných původců (kupříkladu podklady od jiného OVM či od jiného účastníka řízení). V takovém případě platí povinnosti správy dokumentu v ESSL či ISSD a pokud dokument není ve správném výstupním formátu a je od organizace, která nemá za povinnost vykonávat spisovou službu, musí původce takový dokument převést do výstupniho formátu. Zde je to ale už trochu složitější.
- Dokument jiného původce zveřejněný na úřední desce: Speciální pŕípad předchozího způsobu. Původce je mnohdy povinen zveřejnit dokument jiného původce na svojí úřední desce. Problém je, pokud ten kdo takový dokument původci zaslal, nesplnil veškeré povinnosti a požadavky na takový dokument. Původce jej má správně nezveřejnit a uložit odesílateli, aby odstranil vady dokumentu a uvedl ho do souladu se zákonem. Vzhledem k tomu, že původce nemůže při zveřejnění dokumentu na úřední desce tímto dokumentem jakkoliv technicky manipulovat, je to jediný legální způsob, jak požadavky zajistit.
** NEZAHÁJENO Legislativní rámec a práva osob
** NEZAHÁJENO Povinnost vytvářet přístupné dokumenty
** NEZAHÁJENO Práce s přístupným dokumentem a přínosy přístupnosti
** NEZAHÁJENO Důsledky nesplnění přístupnosti dokumentů
* NEZAHÁJENO Jak na to
** NEZAHÁJENO Zahrnutí přístupnosti dokumentů do správy dokumentů a procesů
** ROZPRACOVANÉ Náležitosti dokumentů
:LOGBOOK:
CLOCK: [2022-02-09 Wed 15:32]--[2022-02-09 Wed 15:39] =>  0:07
CLOCK: [2022-02-09 Wed 15:12]--[2022-02-09 Wed 15:14] =>  0:02
:END:
U dokumentů ve spisové službě jsou velice důležité jejich náležitosti. Ať už se jedná o rozhodnutí, nebo o formulář, či o jiný druh dokumentu. Veřejnoprávní původci jsou povinni vytvářet jen takové dokumenty, které splňují veškeré technické požadavky a obsahové a procesní náležitosti. Celá řada z nich pak také souvisí právě s přístupností dokumentu a s jeho identifikací a určením zodpovědné osoby, která taktéž zodpovídá za přístupnost a na niž se může uživatel asistivních technologií v případě problémů a nejasností obrátit.
*** KEKOREKTUŘE Obsahové náležitosti
:LOGBOOK:
CLOCK: [2022-02-09 Wed 15:14]--[2022-02-09 Wed 15:26] =>  0:12
:END:
Obecné náležitosti stanovuje Vyhláška o podrobnostech výkonu spisové služby, další obsahové náležitosti pak stanovují další předpisy (třeba Správní řád, apod.) Platí ale, že každý dokument vzniklý veřejnoprávním původcem bez výjimky musí mít určité obsahové náležitosti, které jsou právě definovány příslušným uastanovením vyhlášky. Tyto náležitosti jsou soućástí dokumentu také proto, aby v případě jakýchkoliv problémů a nejasností mohl být konkrétní dokument jednoznačně identifikován a to platí i o konkrétní osobě za dokument odpovědné a o organizaci původce.


Základní náležitosti z pohledu obsahu a identifikace dokumentu jsou:

- - Označení původce
- Číslo jednací nebo Evidenční číslo ze samostatné evidence
- Číslo jednací nebo evidenční číslo doručeného dokumentu, jedná-li se o odpověď
- Jméno, příjmení a funkce fyzické osoby pověřené jeho podpisem/vyřízením
- Datum podpisu/vyřízení dokumentu
- Podpis (kvalifikovaný elektronický podpis nebo kvalifikovanou elektronickou pečeť) a časové razítko (kvalifikované elektronické časové razítko k podpisu/pečetění)
- Počet listů, počet příloh/částí
*** KEKOREKTUŘE Technické a procesní náležitosti dokumentu
:LOGBOOK:
CLOCK: [2022-02-09 Wed 15:39]--[2022-02-09 Wed 15:39] =>  0:00
CLOCK: [2022-02-09 Wed 15:09]--[2022-02-09 Wed 15:32] =>  0:23
:END:
Technické a procesní náležitosti dokumentu jsou náležitosti a postupy, které po technické stránce zaručují platnost dokumentu. Obdobně jako u náležitostí obsahových tedy platí, pokud některá z uvedených věcí neplatí a není splněna, dokument nevznikl v souladu se zákonem. Proto je třeba se i těmto náležitostem důkladně věnovat.


- Dokument vznikl jako digitální dokument a po celou dobu je evidován a je s ním zacházeno jako s digitálním
- Dokument, jeho životní cyklus a každá událost s ním spojená jsou evidovány v ESSL nebo v ISSD a je řádně veden jeho transakční protokol
- Dokument má jasný identifikátor, kterým je buď Číslo jednací, nebo Evidenční číslo ze samostatné evidence
- K dokumentu jsou řádně evidována veškerá jeho povinná metadata a veškeré subjekty, jichž se týká (zejména odesílatel nebo příjemce)
- Dokument je řádně vyhotoven a zkontrolován před odesláním
- Dokument je vždy ve správném výstupním formátu dle jeho druhu a určení, může existovat pak i v dalších formátech
- Dokument musí obsahovat textovou vrstvu, a to dle specifikace konkrétního výstupního formátu, za její soulad zodpovídá vyřizující osoba a původce
- Dokument v okamžiku vyhotovení a validace obsahuje řádné kvalifikované validační prvky (elektronický podpis, elektronické časové razítko, elektronickou pečeť) v úrovni kvalifikované
- Dokument byl odeslán (zveřejnění je formou odeslání) řádným způsobem
- Lze kdykoliv z ESSL a transakčního protokolu dohledat každou událost, a to včetně zodpovědné osoby

Ne vše si může ověřit uživatel na svém zařízení, ale vše se dá ověřit zpětně. Co se týče technických poźadavků (výstupní formát, textová vrstva a datová strktura), ty pak přímo souvisí s čitelností a přístupností a se zpracováním obsahu dokumentu.
** NEZAHÁJENO Přístupnost u druhů a forem dokumentů
*** NEZAHÁJENO Přístupnost pro digitální dokumenty
*** KEKOREKTUŘE Jak má správně vypadat analogová verze dokumentu, aby šla zpracovat asistivní technologií
:LOGBOOK:
CLOCK: [2022-02-08 Tue 09:03]--[2022-02-08 Tue 10:35] =>  1:32
:END:
Co se týče analogového dokumentu, respektive, přístupnosti takového dokumentu adresovaného klientovi veřejné správy, který má určité speciální potřeby vyplývající z podstaty jeho postižení, je důležité, aby takový analogový dokument byl vytvořen podle určitých pravidel, která zajistí, že klient veřejné správy s postižením bude mít maximální možnost se s takovým dokumentem plně seznámit, a to za použití OCR software, který bude schopen dokument kvalitně rozpoznat a převést do elektronické formy přístupné i pro odečítače obrazovky, jež využívají primárně lidé se zrakovým postižením.

Analogový dokument musí splňovat určité standardy, které zajistí nejlepší možný výsledek procesu rozpoznání textu uvedeného v dokumentu prostřednictvím OCR programu. Podstatou OCR programu (Optical Character Recognition) je dokument prvně naskenovat a následně naskenovaný obrázek automatizovaně rozpoznat, tedy  rozpoznat text uvedený na tištěném dokumentu. Výsledek rozpoznání je pak možné exportovat do textového editoru, kde si jej klient veřejné správy může plně prostudovat, nebo je možné výsledek rozpoznání dokumentu prostřednictvím OCR software uložit do kýženého formátu, kupříkladu formátu *.doc, *.docx, *.txt, *.pdf apod.

Aby byl výsledek OCR procesu co nejlepší, je nutné dodržet tato pravidla:

- dokument vždy vytisknout (tzn. použít pro tisk kvalitní kancelářskou techniku)
- vyvarovat se používání "lesklého" papíru pro tisk dokumentu, tedy křídového papíru či foto papíru (OCR proces bude vykazovat velmi špatný výsledek rozpoznání tehdy, kdy se použije "lesklý" papír, jelikož světlo snímací techniky se odráží zpět a narušuje tak proces rozpoznávání)
- pro tisk dokumentu používat kvalitní, nejlépe, matný bílý papír (tzn. matný bílý papír velmi napomáhá k maximálně kvalitnímu výsledku OCR procesu)
- vyvarovat se jakéhokoliv ručního zápisu textu do dokumentu (tzn. nepsat do dokumentu ručně, rukou psaný text není naprosto vhodný pro proces OCR)
- žádným způsobem do dokumentu dodatečně nezasahovat (tzn. v případě, že se v dokumentu objeví nějaká nesrovnalost, je nutné dokument upravit v jeho digitální podobě, a pak jej opětovně vytisknout)
- zajistit maximální kontrast popředí a pozadí (tzn. použít maximálně bílý papír, a naopak zvolit co nejtmavší barvu tištěného textu)
- zvolit optimální velikost tištěného textu (tzn. velikost textu zvolit tak, aby byl text dobře čitelný i pouhým okem)
- zajistit maximální čitelnost validačních prvků dokumentu (tzn. zajistit čitelnost hodnot úředního razítka a podpisu úřední osoby)
- zvolit optimální font tištěného písma (tzn. vyvarovat se patkového či jinak graficky náročného fontu písma)
- zvolit optimální rozvržení textu v ploše dokumentu (tzn. zajistit optimální rozprostření textu v dokumentu, a tak využít celou jeho plochu)
- analogový dokument posílat neporušené podobě (tzn. zajistit, aby analogový dokument nebyl jakýmkoliv způsobem poničený či deformovaný)
** NEZAHÁJENO Jak řešit přístupnost u jednotlivých způsobů vzniku dokumentu
** NEZAHÁJENO Co je nepřípustné a co nikdy nedělat
* NEZAHÁJENO Návodné a kontrolní seznamy
